{"format": "keras", "nodes": [{"name": "input_1", "id": "input_1", "class_name": "InputLayer", "output_shape": [[null, 28, 28]], "num_parameters": 0}, {"name": "lambda", "id": "lambda", "class_name": "Lambda", "output_shape": [null, 28, 28, 3], "num_parameters": 0}, {"name": "lambda_1", "id": "lambda_1", "class_name": "Lambda", "output_shape": [null, 48, 48, 3], "num_parameters": 0}, {"name": "vgg16", "id": "vgg16", "class_name": "Model", "output_shape": [null, 1, 1, 512], "num_parameters": 14714688}, {"name": "flatten", "id": "flatten", "class_name": "Flatten", "output_shape": [null, 512], "num_parameters": 0}, {"name": "dense", "id": "dense", "class_name": "Dense", "output_shape": [null, 1024], "num_parameters": 525312}, {"name": "dense_1", "id": "dense_1", "class_name": "Dense", "output_shape": [null, 80], "num_parameters": 82000}], "edges": [["input_1", "lambda"], ["lambda", "lambda_1"], ["lambda_1", "vgg16"], ["vgg16", "flatten"], ["flatten", "dense"], ["dense", "dense_1"]]}